In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([1,4,-3,5])

In [3]:
obj.array, obj.index

(<PandasArray>
 [1, 4, -3, 5]
 Length: 4, dtype: int64,
 RangeIndex(start=0, stop=4, step=1))

In [4]:
obj2 = pd.Series([4,6,-2,5], index=['d', 'a', 'c',' b'])
obj2, obj2.index, obj2.array

(d     4
 a     6
 c    -2
  b    5
 dtype: int64,
 Index(['d', 'a', 'c', ' b'], dtype='object'),
 <PandasArray>
 [4, 6, -2, 5]
 Length: 4, dtype: int64)

In [5]:
obj2["a"]
obj2["b"] = 80

In [6]:
obj2

d      4
a      6
c     -2
 b     5
b     80
dtype: int64

In [7]:
obj2[["a", "b", "c"]]

a     6
b    80
c    -2
dtype: int64

In [8]:
obj2[obj2 > 4]

a      6
 b     5
b     80
dtype: int64

In [9]:
np.exp(obj2)

d     5.459815e+01
a     4.034288e+02
c     1.353353e-01
 b    1.484132e+02
b     5.540622e+34
dtype: float64

In [10]:
"b" in obj2, "z" in obj2

(True, False)

In [11]:
sdata = { 'ktm': 1829, 'btl': 12423, 'brt': 192083, 'pokh': 90 }
obj3 = pd.Series(sdata)
obj3

ktm       1829
btl      12423
brt     192083
pokh        90
dtype: int64

In [12]:
obj3.to_dict()
obj3

ktm       1829
btl      12423
brt     192083
pokh        90
dtype: int64

In [13]:
states = ['pokh', 'ktm', 'btl', 'brt']
obj4 = pd.Series(sdata, index=states)

In [14]:
obj4

pokh        90
ktm       1829
btl      12423
brt     192083
dtype: int64

In [15]:
pd.isna(obj4)

pokh    False
ktm     False
btl     False
brt     False
dtype: bool

In [16]:
pd.notna(obj4)

pokh    True
ktm     True
btl     True
brt     True
dtype: bool

In [17]:
obj4.isna(), obj4.notna()

(pokh    False
 ktm     False
 btl     False
 brt     False
 dtype: bool,
 pokh    True
 ktm     True
 btl     True
 brt     True
 dtype: bool)

In [18]:
obj3

ktm       1829
btl      12423
brt     192083
pokh        90
dtype: int64

In [19]:
obj3 + obj4 #data is aligned by index label`

brt     384166
btl      24846
ktm       3658
pokh       180
dtype: int64

In [20]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
pokh        90
ktm       1829
btl      12423
brt     192083
Name: population, dtype: int64

In [21]:
obj

0    1
1    4
2   -3
3    5
dtype: int64

In [22]:
obj.index = ['bob', 'cheems', 'doge', 'sriganesh']
obj.index.name = 'First Name'

In [23]:
obj

First Name
bob          1
cheems       4
doge        -3
sriganesh    5
dtype: int64

In [24]:
# dataframes
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
 "year": [2000, 2001, 2002, 2001, 2002, 2003],
 "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [25]:
frame, frame.head(), frame.tail()

(    state  year  pop
 0    Ohio  2000  1.5
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9
 5  Nevada  2003  3.2,
     state  year  pop
 0    Ohio  2000  1.5
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9,
     state  year  pop
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9
 5  Nevada  2003  3.2)

In [26]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [27]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [28]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [29]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [30]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [31]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [32]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [33]:
frame2["debt"] = 16.8

In [34]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.8
1  2001    Ohio  1.7  16.8
2  2002    Ohio  3.6  16.8
3  2001  Nevada  2.4  16.8
4  2002  Nevada  2.9  16.8
5  2003  Nevada  3.2  16.8

In [35]:
frame2['debt'] = np.arange(6.)

In [36]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [37]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [38]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [39]:
frame2.debt

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
Name: debt, dtype: float64

In [40]:
frame2['debt'] = val

In [41]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [42]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [43]:
del frame2["eastern"]

In [44]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
"Nevada": {2001: 2.4, 2002: 2.9}}

In [46]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [47]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [48]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [49]:
pdata = {"Ohio": frame3["Ohio"][:-1],
 "Nevada": frame3["Nevada"][:2]}

In [50]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [51]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [52]:
frame3.index.name = "YEAR"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
YEAR
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [53]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [54]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [55]:
obj = pd.Series(np.arange(3), index=['a', 'b', 'c'])
index = obj.index

In [58]:
index = obj.index

In [59]:
index

Index(['a', 'b', 'c'], dtype='object')

In [60]:
index[1:]

Index(['b', 'c'], dtype='object')

In [61]:
index[1:]

Index(['b', 'c'], dtype='object')

In [62]:
index[2] = 'hemlo'

TypeError: Index does not support mutable operations

In [63]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int64')

In [64]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [65]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [66]:
obj2.index is labels

True

In [67]:
frame3

state  Ohio  Nevada
YEAR
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [68]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [70]:
"Ohio" in frame3.columns

True

In [71]:
2003 in frame3.index

False

In [72]:
pd.Index(['foo','foo','bar','bar'])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [75]:
obj2 = pd.Series([4.5, 7.2, -5.32, 5.4], index=['d', 'b', 'a', 'c'])

In [78]:
obj2.reindex(['a', 'b', 'c'])

a   -5.32
b    7.20
c    5.40
dtype: float64

In [79]:
obj2

d    4.50
b    7.20
a   -5.32
c    5.40
dtype: float64

In [80]:
obj3 = pd.Series(['blue', 'purple', "yellow"], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [81]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [82]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a', 'c', 'd'],
                    columns = ["Ohio","Texas", "California"])

In [83]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [84]:
frame2 = frame.reindex(index=['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [85]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [86]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [88]:
frame.loc[['a', 'd', 'c'], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [89]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c','d', 'e'])

In [90]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [91]:
new_obj = obj.drop("c")

In [92]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [93]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [94]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [95]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=["Ohio", "Colorado", "Utah", "New York"],
 columns=["one", "two", "three", "four"])

In [96]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [97]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [99]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [100]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [101]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [102]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [103]:
obj["b"]

1.0

In [105]:
obj[1], obj[2:4]

(1.0,
 c    2.0
 d    3.0
 dtype: float64)

In [106]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [107]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [108]:
obj[obj < 3]

a    0.0
b    1.0
c    2.0
dtype: float64

In [109]:
obj.loc[["b", 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [110]:
obj1 = pd.Series([1,2,3], index=[2,0,1])
obj2 = pd.Series([1,2,3], index=["a", "b", "c"])

In [111]:
obj1, obj2

(2    1
 0    2
 1    3
 dtype: int64,
 a    1
 b    2
 c    3
 dtype: int64)

In [112]:
obj1[[1,2]]

1    3
2    1
dtype: int64

In [113]:
obj2[[0, 2]]

a    1
c    3
dtype: int64

In [114]:
obj2.loc[[0, 1]]

KeyError: "None of [Index([0, 1], dtype='int64')] are in the [index]"